app/controllers/stories_controller.rb

  def create
    @story = Story.new(story_params)

    respond_to do |format|
      if @story.save
---
INSERT INTO "stories" ("name", "created_at", "updated_at", "author") VALUES (?, ?, ?, ?) RETURNING "id"  [["name", "SULA"], ["created_at", "2024-10-06 15:26:29.659829"], ["updated_at", "2024-10-06 15:26:29.659829"], ["author", nil]]

  def destroy
    @story.destroy!
---
DELETE FROM "stories" WHERE "stories"."id" = ?  [["id", 1]]